# -*- coding:utf-8 -*-
# @Author  : 'longguangbin'
# @Contact : lgb453476610@163.com
# @Date    : 2018/12/14
"""  
Usage Of 'learn' : 
"""

# 整理一下。复习思路。
# （1）算法 - 原理（ 统计算法 - 时序/检验/统计量/分位数回归 ）（ 机器学习 - lr/svm/rf/xgboost/lightgbm ）（ nlp - nlp 的方法 ）（ 深度学习 - cnn/rnn/lstm/注意力 ）（ 图像 - 图像算法 ）
#       1.1 统计算法 - 哪本书/网站 - 时间序列（控制图理论）
#       1.2 机器算法 - 哪本书/网站
#       1.3 nlp     - 哪本书/网站
#       1.4 深度学习 - 哪本书/网站
#       1.5 图像识别 - 哪本书/网站
#       1.5 R       - 哪本书/网站 - 达到基本算法的使用探索即可
# （2）数据结构与算法 - java + leetcode 刷题
#       2.1 能在 IDEA 上面运行    - ok
#       2.2 算法导论等等的算法实现
# （3）已有工作经验的总结
#       3.1 预测的一些基本考虑   - 架构搭建、预处理过程（问题-解决）、特征工程（问题-解决|促销-天气-节假日-季节性）、算法模型（ml-ts-融合）、后处理、常问题（数据倾斜-不平衡）
# （4）其他
#       4.1 大数据   - Spark / Hive
#       4.2 后端     - Java / Docker
#       4.3 前端     - Js / Vue
